ZigEmbeddedGroup/microzig/port/hdsc/hc32l110/src/chips/HC32L110.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>FLASH</name>
            <description>desc FLASH</description>
            <baseAddress>0x40020000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x34</size>
            </addressBlock>
            <registers>
                <register>
                    <name>TNVS</name>
                    <description>desc TNVS</description>
                    <addressOffset>0x0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x32</resetValue>
                    <resetMask>0x1FF</resetMask>
                    <fields>
                        <field>
                            <name>TNVS</name>
                            <description>desc TNVS</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TPGS</name>
                    <description>desc TPGS</description>
                    <addressOffset>0x4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x23</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>TPGS</name>
                            <description>desc TPGS</description>
                            <msb>7</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TPROG</name>
                    <description>desc TPROG</description>
                    <addressOffset>0x8</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x27</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>TPROG</name>
                            <description>desc TPROG</description>
                            <msb>7</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TSERASE</name>
                    <description>desc TSERASE</description>
                    <addressOffset>0xC</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x18000</resetValue>
                    <resetMask>0x3FFFF</resetMask>
                    <fields>
                        <field>
                            <name>TSERASE</name>
                            <description>desc TSERASE</description>
                            <msb>17</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TMERASE</name>
                    <description>desc TMERASE</description>
                    <addressOffset>0x10</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x140000</resetValue>
                    <resetMask>0x1FFFFF</resetMask>
                    <fields>
                        <field>
                            <name>TMERASE</name>
                            <description>desc TMERASE</description>
                            <msb>20</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TPRCV</name>
                    <description>desc TPRCV</description>
                    <addressOffset>0x14</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x24</resetValue>
                    <resetMask>0xFFF</resetMask>
                    <fields>
                        <field>
                            <name>TPRCV</name>
                            <description>desc TPRCV</description>
                            <msb>11</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TSRCV</name>
                    <description>desc TSRCV</description>
                    <addressOffset>0x18</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x240</resetValue>
                    <resetMask>0xFFF</resetMask>
                    <fields>
                        <field>
                            <name>TSRCV</name>
                            <description>desc TSRCV</description>
                            <msb>11</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TMRCV</name>
                    <description>desc TMRCV</description>
                    <addressOffset>0x1C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1000</resetValue>
                    <resetMask>0x1FFF</resetMask>
                    <fields>
                        <field>
                            <name>TMRCV</name>
                            <description>desc TMRCV</description>
                            <msb>12</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CR</name>
                    <description>desc CR</description>
                    <addressOffset>0x20</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x7F</resetMask>
                    <fields>
                        <field>
                            <name>OP</name>
                            <description>desc OP</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>WAIT</name>
                            <description>desc WAIT</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BUSY</name>
                            <description>desc BUSY</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>IE</name>
                            <description>desc IE</description>
                            <msb>6</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IFR</name>
                    <description>desc IFR</description>
                    <addressOffset>0x24</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x3</resetMask>
                    <fields>
                        <field>
                            <name>IF0</name>
                            <description>desc IF0</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>IF1</name>
                            <description>desc IF1</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ICLR</name>
                    <description>desc ICLR</description>
                    <addressOffset>0x28</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x3</resetValue>
                    <resetMask>0x3</resetMask>
                    <fields>
                        <field>
                            <name>ICLR0</name>
                            <description>desc ICLR0</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>ICLR1</name>
                            <description>desc ICLR1</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BYPASS</name>
                    <description>desc BYPASS</description>
                    <addressOffset>0x2C</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>BYSEQ</name>
                            <description>desc BYSEQ</description>
                            <msb>15</msb>
                            <lsb>0</lsb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SLOCK</name>
                    <description>desc SLOCK</description>
                    <addressOffset>0x30</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>SLOCK</name>
                            <description>desc SLOCK</description>
                            <msb>15</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
